[
  {
    "publication_number": "CA-2558029-C",
    "title": "Ion binding polymers and uses thereof",
    "abstract": "The present invention provides methods and compositions for the treatment of ion imbalances. In particular, the invention provides compositions comprising potassium binding polymers and pharmaceutical compositions thereof. Methods of use of the polymeric and pharmaceutical compositions for therapeutic and/or prophylactic benefits are disclosed herein. Examples of these methods include the treatment of hyperkalemia, such as hyperkalemia caused by renal failure and/or the use of hyperkalemia causing drugs."
  },
  {
    "publication_number": "CA-2680748-C",
    "title": "Methods for the diagnosis and risk assessment of plasmalogen deficiency mediated diseases of aging",
    "abstract": "The present invention relates to methods for the diagnosis and risk assessment of plasmalogen deficiency mediated diseases of aging. The present invention describes the relationship between plasmalogen biosynthesis dysfunction and the biochemical and clinical manifestations of age related disorders. Specifically the present invention describes an increased prevalence of colon cancer, prostate cancer, lung cancer, breast cancer, ovary cancer, kidney cancer, cognitive impairment and dementia in subjects suffering from adult onset plasmalogen biosynthesis disorder (AO-PBD)."
  },
  {
    "publication_number": "CA-2540125-C",
    "title": "Toothbrush with severable electrical connections",
    "abstract": "Disclosed is an electrical connector having particular application in an oral care implement having a removable and/or replaceable head. In particular, an electric toothbrush having a removable brush head and/or head and neck assembly and a severable electrical connector is disclosed in which the brush head includes one or more elements requiring a source of electrical power. The severable electrical connector provides electrical communication between the brush head and a power source retained within the handle or handle portion of the toothbrush."
  },
  {
    "publication_number": "CA-2147683-C",
    "title": "Long wear life flame-retardant cotton blend fabrics",
    "abstract": "Flame-retardant treated cotton/thermoplastic fiber blend fabrics have been discovered which have extended wear life and retain their flame-retardant treatment for the life of the garment."
  },
  {
    "publication_number": "CA-1122693-A",
    "title": "Ultrasonic testing of welds in wheels",
    "abstract": "ABSTRACT OF THE DISCLOSURE         Methods and means for testing and storing data relating to the quality of resistance spot welds in an automotive wheel are provided.  The wheel may be rotated for one revolution or less, dependent upon the number of transducers used, while a counter generates pulse signals representative of the locations of the wheel as it is revolved.  Ultrasonic signals are trans-mitted towards and received from locations in the wheel at which the presence of welds is being tested.  Storage devices, responsive to signals from the counter and the received ultrasonic signals store counts representative of the locations on the wheel where acceptable welds start and end to thereby determine the diameters of the welds.  me data stored also indicate locations and durations of voids in the welded areas."
  },
  {
    "publication_number": "CA-1265568-A",
    "title": "Linear stepping motor",
    "abstract": "ABSTRACT OF THE DISCLOSURE                 This invention relates to a linear step motor wherein exciting iron cores, provided with a plurality of field legs, are separated from each other in the direction perpendicular to the direction of movement of its moving part, and in which a magnetic field of a permanent magnet, and a magnetic field of an exciting coil are crossed at a right angle.  The step motor steps in a straight line at a constant pitch conforming accurately to a pulse input signal."
  },
  {
    "publication_number": "CA-1108733-A",
    "title": "Electric vehicle traction motor control",
    "abstract": "ABSTRACT OF THE DISCLOSURE            An electric vehicle traction motor control circuit includes a main thyristor in series with the motor armature.          A second thyristor is connected in series with a commutating capacitor across the main thyristor which can be switched off by firing the second thyristor so that the motor current is diverted into the commutating capacitor.  A third thyristor is connected in series with an inductor across the commutating capacitor and serves when fired to reverse the voltage re??ding on the commutating capacitor following commutating.  The reversed voltage on the capacitor is detected and is used to control upper and lower current limit signals set by a driver operable control so that the capacitor is not called upon to receive a large current when it is in a low voltage condition."
  },
  {
    "publication_number": "CA-1261317-A",
    "title": "Percussion rock bit",
    "abstract": "PERCUSSION ROCK BIT          Abstract of the Disclosure A percussion rock bit comprises a steel body having means for connection to a drill string at one end and having a plurality of inserts at the other end for crushing rock at the bottom of a hole being drilled.   The  inserts have a cemented tungsten carbide body partially embedded in the steel bit and at least two layers at the protruding  drilling  portion  of  the  insert.    The  outermost  layer contains polycrystalline diamond.   The remaining layers adjacent the polycrystalline  diamond  layer  are  transition  layers  containing  a composite of diamond crystals and  precemented tungsten carbide, the composite  having  a  higher  diamond  crystal  content  adjacent  the polycrystalline diamond layer and a higher precemented tungsten carbide content adjacent the tungsten carbide layer."
  },
  {
    "publication_number": "CA-2683402-C",
    "title": "Alias hiding in network data repositories",
    "abstract": "A logical network directory database compliant with the X.500 standard for a directory data system is disclosed. The network directory database provides a source of subscriber and service data accessible by various control and management processes that require subscriber information. The network directory database may be extensible across various communications service providers and IT domain. Further, the disclosed network directory database may be applied to new and existing services, such as, IP Multimedia Subsystem, Unlicensed Mobile Access (UMA) and other IP services."
  },
  {
    "publication_number": "CA-2128143-C",
    "title": "Exhaust gas catalytic converter, particularly for motor cars",
    "abstract": "The exhaust gas catalytic converter (1) with an ordered substrate structure (10) for catalysing material comprises layers (13) with parallel channels. The layers are substantially parallel to the direction (15) of main flow of the exhaust gas. The cross-sectional surfaces of the substrate structure along the direction of main flow has, according to the invention, at least partly variable area and/or variable shape; the channels make with the direction of main flow and angle between about 10° and 70° and the channels in adjacent layers are open towards each other and cross each other. The exhaust gas catalytic converter according to the invention enables its shape to be adapted to the conditions of small space."
  },
  {
    "publication_number": "CA-2255714-C",
    "title": "Improved phototherapeutic methods and devices for irradiating columnar environments",
    "abstract": "The present invention provides improved meth-ods and devices for delivering light to the surface of a biological column, for example in treatment of Bar-rett\u0026#39;s esophagus using PDT. The improvement com-prises the use of an extended irradiation segment or window (as seen in panel A of drawing Fig. 1).    The improved methods of the present invention per-mit treatment lenghts of the biological column to be increased without increasing the incidence of stricture formation."
  },
  {
    "publication_number": "CA-1327142-C",
    "title": "Two ply thermal paper and method of making",
    "abstract": "TWO PLY THERMAL PAPER AND METHOD OF MAKING            Abstract of the Disclosure A two-ply laminated record medium has a thermally reactive coating applied to the base sheet and the top sheet is applied to the base sheet by using a wet lamination process.  The coating provides sufficient adhesion to prevent separation of the top sheet and the base sheet during printing, while allowing for ease of separation of the two sheets after printing."
  },
  {
    "publication_number": "CA-1335796-C",
    "title": "Monoclonal antibodies and antigen for human non-small  cell lung carcinomas",
    "abstract": "The present invention is concerned with novel mono-clonal antibodies which define a glycolipid antigen as-sociated with human non-small cell lung carcinomas (\u0026#34;NSCLC\u0026#34;) and certain other human carcinomas.  The anti-bodies bind to normal human cells to a much lesser de-gree than to tumor cells.  The antibodies find use in diagnostic methods such as the detection of malignant cells associated with NSCLC and in therapeutic methods. Also disclosed is a novel glycolipid antigen.  The in-vention also comprises a method for determining the pre-sence of a malignant condition in lung tissue and other human tissue.  The method involves examining the human tissue for the presence of a glycolipid antigen having the terminal carbohydrate sequence: GalNAc.beta.1?4Gal.beta.1?3GalNAc.beta.1?4Gal.beta.1?R."
  },
  {
    "publication_number": "CA-2398122-C",
    "title": "Debris barrier",
    "abstract": "The invention provides a lightweight, temperature-resistant debris shield suitable for used within a closed vessel. The invention has no small parts, and can be readily assembled and disassembled in a confined space without tools after passing through a tight passage such as a pressure vessel manway."
  },
  {
    "publication_number": "CA-1055987-A",
    "title": "Carbonless manifold business forms",
    "abstract": "TITLE OF THE INVENTION:           CARBONLESS MANIFOLD BUSINESS FORMS INVENTOR:           GEORGE E. MAALOUF ABSTRACT OF THE DISCLOSURE: sets of manifold business forms are coated on selected surfaces thereof with chemicals which are capable of reacting with each other to produce a colored mark.  In one arrangement at least one intermediate sheet is coated on one surface with a composition of record-developing material (which is generally solid) and a non-compatible color precursor (which is generally in the form of a microencapsulated liquid) to thereby function as both a record-receiving and a color-transfer surface upon reacting with the coating of at least another separate sheet of the set containing another compatible color precursor and/or another record-developing material on the surface thereof.  In another arrangement, some of the sheets are coated front and back with a record-developing material, while others are coated front and back with a microencapsulated color precursor.  In each of the arrangements the sheets of the  manifold sets are capable of being so arranged such that by removal of certain parts of the sets or turning certain parts upside down and applying pressure on the backs of the sets, images may be developed on both sides of the sheets."
  },
  {
    "publication_number": "CA-2702980-C",
    "title": "Fluid balance control system for use in a fuel processor",
    "abstract": "A method and apparatus for providing a balanced fluid supply through multiple feeds are disclosed. The method comprises supplying the fluid through a plurality of feeds from a common fluid accumulator; determining the fluid pressure in a common fluid accumulator; and controlling the fluid pressure in the common fluid accumulator responsive to the fluid pressure sensed therein to maintain the fluid pressure within a predetermined range. The balanced fluid supply comprises a common fluid accumulator; a plurality of feeds from the common fluid accumulator; and a control system capable of controlling the pressure of the fluid supplied from the common fluid accumulator to the feeds responsive to a determined pressure of fluid in the common fluid accumulator."
  },
  {
    "publication_number": "CA-2572532-C",
    "title": "Method and apparatus for provisioning a device to access services in a universal plug and play (upnp) network",
    "abstract": "A method and apparatus are provided for enabling a Universal Plug and Play (UPnP) device to be automatically provisioned to access services without the need for manual interaction. In accordance with the invention, when a UPnP device needs to be provisioned, it automatically obtains pre-provisioning information from a provisioning device on the home network, and uses the pre-provisioning information to interact with the provisioning device to cause the UPnP device to be provisioned. The provisioning enables the UPnP device to access services, including digital rights management (DRM) services, over a network."
  },
  {
    "publication_number": "CA-1102057-A",
    "title": "Hand grip mounted switch and strain relief",
    "abstract": "ABSTRACT OF THE DISCLOSURE      A floor care appliance or the like is provided with a hand grip having a switch retaining member that also serves as a portion of the means utilized for retention of a cord strain relief."
  },
  {
    "publication_number": "CA-2699970-C",
    "title": "Internal crosstalk compensation circuit formed on a flexible printed circuit board positioned within a communications outlet, and methods and systems relating to same",
    "abstract": "A communications outlet includes eight outlet tines positioned adjacent to one another and define four pairs of outlet tines. The fourth and fifth outlet tines define a first pair, the first and second outlet tines define a second pair, the third and sixth outlet tines define a third pair, and the seventh and eighth outlet tines define a fourth pair. Each outlet tine has a free end near which a plug tine is adapted to contact the outlet tine and each outlet tine has a fixed end coupled through a corresponding conductive tine to a corresponding electrical contact. The communications outlet includes an internal crosstalk compensation stage having a plurality of conductive fingers.  Each conductive finger is physically connected to a corresponding one of the outlet tines proximate the free ends of the tines. The internal crosstalk compensation stage is operable to provide positive compensation for internal crosstalk between pairs corresponding to the tines to which the conductive fingers of the flexible printed circuit board are attached."
  },
  {
    "publication_number": "CA-1266762-A",
    "title": "Apparatus for automated mounting of a door or similar  closure component within the relative opening formed  in a body, in particular an automotive vehicle body",
    "abstract": "ABSTRACT            The present invention relates to an apparatus for the automated mounting of a door or similar closure component within the relative  opening  formed  in  a  body,  particularly  an automotive  vehicle  body,  comprising  in  combination:  a device      for stably supporting a body     , a conveyor device      adapted to convey a door      to an approach position to the relative door opening       in the body , provision being made between the said device for a first movable  apparatus       for reading the measurements of the  opening       and  a  second movable apparatus        for  removing  the  door        from  the conveyor      and positioning it within the door opening The apparatus          are also operatively interconnected through  the intermediary of a computer       adapted to accept signals from the apparatus     ,  to process them and send them to the apparatus   .            Provision  is  made,  lastly,  for  actuating  means adapted to selectively move the apparatus      between an inoperative position and a operative proximal to the door opening      and the apparatus      between two operative positions proximal respectively to the conveyor      and the door opening    ."
  },
  {
    "publication_number": "CA-2047981-C",
    "title": "Receptor layer transfer sheet, thermal transfer sheet, thermal transfer method and apparatus therefor",
    "abstract": "There is provided a receptor layer transfer sheet which is capable of providing images of high quality on a transfer receiving material having an unsmooth surface, even when it is used in combination with a conventional thermal transfer material.   There is also provided a thermal transfer sheet which is capable of providing images of high quality on a transfer receiving material having an unsmooth surface.   There is further provided a thermal transfer method and a thermal transfer apparatus which are capable of providing images  of  high  quality  and  do  not  require  a  special detection mark provided in (or on) a thermal transfer sheet to be used in combination therewith."
  },
  {
    "publication_number": "CA-2751329-C",
    "title": "Fiber optic jack and connector",
    "abstract": "The present invention provides a fiber optic jack for routing optical signals.  In another aspect, the present invention provides a fiber optic connector with accurate alignment that may be used with, among other things, the fiber optic jack"
  },
  {
    "publication_number": "CA-2709820-C",
    "title": "Combustion engine having mutually connected pistons",
    "abstract": "Combustion engine comprising interconnected combustion cylinders (1, 2, 3, 4), comprising at least two sets of each two opposed working combustion cylinders (1, 2, 3, 4), said two cylinders of each set being interconnected by a common piston rod (5, 6), said two piston rods (5, 6) being connected by one balance arm (7), and the exploitable energy is taken from the kinetic energy of said balance arm (7)."
  },
  {
    "publication_number": "CA-1209250-A",
    "title": "Micro-computer control for a video machine",
    "abstract": "ABSTRACT OF THE DISCLOSURE         An interface circuit is provided for combining a personal computer system with a home type video tape recorder (VTR).          The proposed interface circuit enables the VTR to store a computer program just like an auxiliary memory, and the VTR can be operated based on the program stored on a portion of a video tape.  A preferred application is to use the VTR as an interactive educational machine."
  },
  {
    "publication_number": "CA-1136062-A",
    "title": "Heat-reactivatable adsorbent gas fractionator  and process",
    "abstract": "Abstract:         A process and apparatus are provided for removing a first polar gas from a mixture thereof with a second gas. The gas mixture is passed through a sorbent bed having a preferential affinity for the first polar gas and the first polar gas is sorbed thereon so as to produce a gaseous effluent which has a concentration of first polar gas therein below a predetermined maximum. Then the polar gas sorbed on the sorbent bed is removed therefrom by application of microwave energy, at a temperature at which the sorbent is transparent to such energy, while passing a purge flow of gas in contact with the bed to flush out desorbed first polar gas from the bed. The bed is allowed to cool to a relatively efficient temperature for adsorption. The gas mixture is then again passed in contact with the bed. If two beds are used, one bed can be desorbed while the other is on-stream thereby maintaining a substantially continuous flow of effluent gas."
  },
  {
    "publication_number": "CA-2778179-C",
    "title": "System and method for processing an input fuel gas and steam to produce carbon dioxide and an output fuel gas",
    "abstract": "A method and system for processing an input fuel gas and steam to produce separate CO2 and output fuel gas streams. The method comprises the steps of using a decarboniser segment for reacting at least a solid sorbent reacts with the fuel gas and steam to remove carbon from the input fuel gas and to produce the output fuel gas stream in an exhaust gas from the decarboniser; using a calciner segment for reacting the solid sorbent from the decarboniser segment therein to release the CO2 into the CO2 gas stream; wherein CO2 partial pressures and temperatures in the decarboniser and calciner segments respectively are controlled such that the temperature in the decarboniser segment is higher than the temperature in the calciner."
  },
  {
    "publication_number": "CA-1197387-A",
    "title": "Yieldable connection",
    "abstract": "TITLE: \u0026#34;YIELDABLE CONNECTION\u0026#34;               ABSTRACT OF THE DISCLOSURE            The invention provides a yieldable connection between a metallic rod-shaped body and a holding means through which it passes and is intended particularly for yieldable rock bolts (roof bolts) anchor bolts and yieldable props, e.g. for mining and tunnelling. For that purpose shear bodies, e.g. spheres or inclined cylindrical pins are provided between the holding means and the slidable rod-shaped body and project some distance into the cross-section of the rod-shaped body.  On sliding of the latter, in the holding means, these shear bodies form grooves in the rod, whereby energy is absorbed.     Inventor:  FRANZ POWONDRA"
  },
  {
    "publication_number": "CA-1318042-C",
    "title": "Intrinsic-safety nuclear reactor of the pressurized  water type",
    "abstract": "ABSTRACT OF THE DISCLOSURE            The subject-matter of the invention is an intrinsic-safety nuclear reactor of the pressurized water type, having a reactor vessel equipped with a core, a lower header and an upper header, at least one heat exchanger with a secondary fluid, means of hydraulic connection between said headers and said heat exchanger and at least one circulation pump; a pressurized container surrounding the reactor vessel and which defines a tank full of a cold,  neutron-absorbing liquid; and pipes allowing communication between the lower area of the tank and the lower header of the vessel, as well as pipes allowing communication between the upper area of the vessel and the upper header, in which the pressure drop in the primary fluid across the core is substantially equal to the difference in head between the cold column of the tank and the hot column of the vessel.  According to the invention, the pressurized container is immersed in a pool containing  a  neutron-absorbing  liquid  at  atmospheric pressure.  Furthermore, the wall of the vessel is insulated, while the wall of the container has no insulation, so as to achieve the greatest possible heat exchange between the wall and the water of the surrounding pool."
  },
  {
    "publication_number": "CA-2292610-C",
    "title": "Open intervertebral spacer",
    "abstract": "Open chambered spacers, implanting tools and methods are provided. The spacers (500\u0026#39;) include a body (505\u0026#39;) having a wall (506\u0026#39;) which defines a chamber (530\u0026#39;) and an opening (531\u0026#39;) in communication with the chamber (530\u0026#39;). In one embodiment the wall (506\u0026#39;) includes a pair of arms (520\u0026#39;, 521\u0026#39;) facing one another and forming a mouth (525\u0026#39;) to the chamber (530\u0026#39;). Preferably, one of the arms (520\u0026#39;) is truncated relative to the other, forming a channel (526). In one aspect the body (505\u0026#39;) is a bone dowel comprising an off-center plug from the diaphysis of a long bone. The tools (800) include spacer engaging means for engaging a spacer and occlusion means for blocking an opening defined in the spacer. In some embodiments, the occlusion means (820) includes a plate (821) extendable from the housing (805). In one specific embodiment the plate (821) defines a groove (822) which is disposed around a fastener (830) attached to the housing (805) so that the plate (821) is slideable relative to the housing (805)."
  },
  {
    "publication_number": "CA-2709457-C",
    "title": "Denox of diesel engine exhaust gases using a temperature-controlled precatalyst for providing no2 in accordance with the requirements",
    "abstract": "Adherence to exhaust gas limit values for diesel vehicles requires removal of nitrogen oxides from exhaust gas.  \u0026#39;Active SCR process\u0026#39; is a preferred method. Nitrogen oxide conversions achieved by this process are particularly high when an optimal NO2/NOX ratio is set upstream of the SCR  catalyst. The invention proposes a process which solves the problem of supplying NO2 in accordance with requirements by temperature control of the precatalyst which is decoupled from the operating state of the engine. In an associated apparatus, a precatalyst which contains at least one oxidation component and whose temperature can be controlled independently of the operating state of the engine, and an active SCR stage comprising an SCR catalyst with upstream metering facility for a reducing agent from an external source are arranged in series. A particle filter can be arranged between precatalyst and metering facility. The precatalyst can contain a nitrogen oxide storage material."
  },
  {
    "publication_number": "CA-1232703-A",
    "title": "Shaped sanitary napkin with flaps",
    "abstract": "SHAPED SANITARY NAPKIN WITH FLAPS             ABSTRACT       A shaped sanitary napkin. The sanitary napkin of this invention has an absorbent means, such as an absorbent core, and two flaps extending outwardly from the absorbent means. Each flap is associated with the absorbent means along a nonlinear line of juncture and each has two axes of flexibility. In use, the absorbent means is secured in the crotch of a panty and the flaps are secured about the elastic edges of the panty so that, when the panty is worn, the absorbent means is held adjacent the body while the flaps form a wall at each side of the absorbent means and seals against the body. Both the walls and the seals serve to prevent soiling of the body and clothing by menstrual fluid."
  },
  {
    "publication_number": "CA-1332314-C",
    "title": "Formulation of molded lactitol-containing food",
    "abstract": "Abstract:         The present invention is directed to a method for molding lactitol-containing foods including food additives which comprises heating a mixture of a solid food material and lactitol which mixture contains not less than 30% by weight of lactitol, molding the mixture in a semi-molten state and optionally pulverizing the molded product."
  },
  {
    "publication_number": "CA-2290250-C",
    "title": "Railway locomotive ecp train line control",
    "abstract": "An interface adapter is provided between the locomotive MU cable and the ECP  trainline permitting ECP data from the lead locomotive to be transmitted via the MU  cable on trailing locomotives to a train of ECP cars. On the lead locomotive, the HEU  Echelon interface is on a suitable line in the MU cable instead of the separate ECP  tramline such that trailing locomotives do not require a separate ECP trainline. The adapter generally employs two transceivers configured as back-to-back repeaters to bridge ECP  data between the locomotive MU cable and the ECP trainline. A DC-DC converter can be used to provide the ECP trainline voltage, either as 230 VDC or as a lower voltage. In lower voltage systems the converter may be replaced by a voltage regulator, or may be eliminated. In any case, an inductor is employed on the output to provide a high impedance to the overlay transceiver."
  },
  {
    "publication_number": "CA-2842705-C",
    "title": "Amphiphilic macromolecule and use",
    "abstract": "The present invention provides an amphiphilic macromolecule and use thereof.  The amphiphilic macromolecules have structural units to adjust molecular weight and molecular weight distribution and charging property effects, high stereo-hindrance structural units, and amphiphilic structural units, are suitable for fields such as oil field well drilling, well cementation fracturing, oil gathering and transfer, sewage treatment, sludge treatment and papermaking, etc., and can be used as an oil-displacing agent for enhanced oil production, a heavy oil viscosity reducer, a fracturing fluid, a clay stabilizing agent, a sewage treatment agent, a papermaking retention and drainage aid or a reinforcing agent, etc."
  },
  {
    "publication_number": "CA-2815955-C",
    "title": "Receiver apparatus and method for receiving a three-dimensional broadcast signal in a mobile environment",
    "abstract": "The present invention relates to a method and apparatus for receiving a three-dimensional broadcast image in a mobile environment. The method for receiving a three-dimensional broadcast image according to one embodiment of the present invention comprises the following steps: receiving a broadcast signal including a left-view image and a right-view image for a three-dimensional broadcast image, and a service signaling channel for signaling the three-dimensional broadcast image; parsing a service map table (SMT) contained in the service signaling channel, parsing, from the parsed SMT, component-type information for indicating whether or not a three-dimensional video stream including the left-view image and the right-view image is contained in the broadcast signal, and parsing, from the SMT, left/right-view image information for indicating whether the left-view image or right-view image is transmitted through a specific region of a single video frame, if the component-type information indicates that the three-dimensional video stream containing the left-view image and the right-view image is contained in the broadcast signal; formatting the left-view image and the right-view image into a three-dimensional image on the basis of the parsed left/right-view image information; and displaying the three-dimensional image."
  },
  {
    "publication_number": "CA-2716471-C",
    "title": "Extreme offset nose assembly",
    "abstract": "An apparatus and method for uti-lizing an extreme offset nose assembly for in-stalling fasteners are disclosed involving a draw-bar, an anvil, and a collet. The drawbar having a first portion, a second portion, a third portion.  The third portion transitioning from the second portion by a chamfer or a shoulder. The anvil having a cavity, a first aperture, and a second aperture. The collet having a first bore and a sec-ond bore. The drawbar having a section of the first portion disposed within the first aperture, a front section of the second portion threadedly en-gaged within the second bore of the collet, a rear-ward section of the second portion passing through the second aperture of the anvil thereby providing a bearing surface between the rearward section of the second portion and the second aperture of the anvil, and the third portion pass-ing through the second aperture of the anvil."
  },
  {
    "publication_number": "CA-2659818-C",
    "title": "Aircraft conduit",
    "abstract": "The object of the invention is a conduit (26) integrated in an aircraft pipe (20) characterized in that it is made from a composite material comprising a geopolymer resin matrix reinforced with fibers."
  },
  {
    "publication_number": "CA-2193026-C",
    "title": "System and method for disaster recovery in an open metering system",
    "abstract": "System and method for securely backing up and reliably retrieving vault data in a metering system that includes a host processor operatively coupled to a vault. Whenever a transaction is completed by the vault, the vault cryptographically signs the vault data, including ascending register, descending register and piece count and sends the cryptographically signed vault data to the host processor where it is stored in a data file assigned to the vault. Each storage of the cryptographically signed vault data is indexed to create a historical log of vault transactions. If the vault is lost or damaged so that vault data cannot be retrieved from the vault, the cryptographically signed vault data is retrieved from the host processor data file and verified."
  },
  {
    "publication_number": "CA-2573223-C",
    "title": "Aromatic compound",
    "abstract": "The present invention provides a novel compound, which has an excellent effect of suppressing the generation of collagen and less side effects, with being excellent in terms of safety. The compound of the present invention is represented by the following general formula (1): [wherein X1 represents a nitrogen atom or a group -CH\u003d; R1 represents a group -Z-R6, wherein Z  represents a group -CO-, a group -CH(OH)-, or the like, and R6 represents a 5-to 15-membered monocyclic, dicyclic, or tricyclic, saturated or unsaturated heterocyclic group having 1 to 4 nitrogen atoms, oxygen atoms, or sulfur atoms; R2 represents a hydrogen atom, a halogen atom or a lower alkylene group; Y represents a group -O-, a group -CO-, a group -CH(OH)-, a lower alkylene group, or the like; and (A) represents a group or the like, wherein R3 represents a hydrogen atom, a lower alkoxy group, or the like, p represents 1 or 2, and R4 represents an imidazolyl lower alkyl group or the like."
  },
  {
    "publication_number": "US-5869067-A",
    "title": "Bi-aromatic compounds and pharmaceutical and cosmetic compositions",
    "abstract": "The present invention relates to new aromatic compounds, to their preparation and to their use in human and veterinary medicine and in cosmetic compositions."
  },
  {
    "publication_number": "CA-2660745-C",
    "title": "Method and apparatus for high rate packet data transmission",
    "abstract": "In a data communication system capable of variable rate transmission, high rate packet data transmission improves utilization of the forward link and decreases the transmission delay. Data transmission on the forward link is time multiplexed and the base station transmits at the highest data rate supported by the forward link at each time slot to one mobile station. The data rate is determined by the largest C/I measurement of the forward link signals as measured at the mobile station. Upon determination of a data packet received in error, the mobile station transmits a NACK message back to the base station. The NACK message results in retransmission of the data packet received in error. The data packets can be transmitted out of sequence by the use of sequence number to identify each data unit within the data packets."
  },
  {
    "publication_number": "CA-2075526-C",
    "title": "Conveyorized vacuum applicator and method therefor",
    "abstract": "A method of and apparatus that is continuously automatically operative in an in-line system is described for applying under heat, vacuum and mechanical pressure a photoresist-forming layer to printed circuit boards that already have been prelaminated by the loose application thereto of dry film as discrete cut sheets within the confines of the surface of the boards whereby a laminate without entrapped air bubbles and closely conforming to the surface contours such as circuit traces of the printed circuit board is obtained.  Featured is a two-part conveyorized vacuum applicator comprising as one part two input conveyors in end-to-end relation and as the other part a belt conveyor and vacuum laminator.  The belt conveyor is characterized in its use of an endless belt having an aperture therein through which, in the vacuum laminating condition of the applicator, the movable lower platen of the vacuum laminator is movable upwards into sealing contact with the upper platen of the laminator, with the printed circuit board to be laminated and a portion of the upper run of the endless belt contained within the vacuum chamber of the laminator."
  },
  {
    "publication_number": "CA-2465868-C",
    "title": "A method of detecting and/or identifying adeno-associated virus (aav) sequences and isolating novel sequences identified thereby",
    "abstract": "A method for detecting and isolating AAV sequences in a sample of DNA obtained from tissue or cells is provided. The invention further provides AAV sequences identified by this method, and vectors constructed using these sequences."
  },
  {
    "publication_number": "CA-2612229-C",
    "title": "Grip belt drive system",
    "abstract": "The present invention describes an improved grip belt drive system for use in sealing machines used to wrap articles in thermoplastic film. Briefly, a timing belt is used in place of the traditional flat or V belt. The presence of teeth on the pulleys, coupled with the use of a timing belt eliminates the possibility of slippage between the belt and the pulleys. To protect the system in the case of a film jam or misplaced article, a torque- limiting mechanism is included, which disengages the drive system if there is excessive counterforce . Furthermore, the outer surface of timing belt contains a pattern, which when mated with a second belt having the same or a complementary pattern, meshes in such a way so that the two belts are positively locked in both the longitudinal and transverse directions."
  },
  {
    "publication_number": "CA-2580560-C",
    "title": "Compositions and methods for inhibiting expression of anti-apoptotic genes",
    "abstract": "The present invention relates to a double-stranded ribonucleic acid (dsRNA) for inhibiting the expression of an anti-apoptotic gene, comprising an antisense strand having a nucleotide sequence which is less that 25 nucleotides in length and which is substantially complementary to at least a part of an apoptotic gene, such as a Bcl gene. The invention also relates to a pharmaceutical composition comprising the dsRNA together with a pharmaceutically acceptable carrier; methods for treating diseases caused by the expression of an anti-apoptotic gene using the pharmaceutical composition;  and methods for inhibiting the expression of an anti-apoptotic gene in a cell."
  },
  {
    "publication_number": "CA-2027605-C",
    "title": "Process for treating a spent nickel-based absorbent",
    "abstract": "The invention relates to a process for treating a spent nickel-based absorbent and for extending the useful life of nickel-based absorbents. The process for treating a spent absorbent material which originally consists of a supported mixture of nickel oxide and metallic nickel comprises the step of heating the spent material under a flow of non-oxidizing gas at a temperature of between 150°C to 450°C."
  },
  {
    "publication_number": "CA-2351433-C",
    "title": "Compositions and methods for treating hair and skin using aqueous delivery systems",
    "abstract": "Compositions containing at least one organic phospholipid capable of forming bilayers in aque-ous solution; and at least one amphoteric surfactant and at least one nonionic surfactant, each present in an amount by weight equal to or greater than the amount of the phospholipid; where the phospholipid and surfactants are present in a combined amount sufficient to allow at least one water-insoluble ingre-dient selected from waxes and unneutralized and par-tially neutralized water-insoluble polymers, resins, and latexes to be incorporated into an aqueous solu-tion. A delivery system containing the composition and methods for styling hair and for treating kerati-nous substances are also disclosed."
  },
  {
    "publication_number": "CA-2713874-C",
    "title": "Method and reactor for the preparation of methanol",
    "abstract": "Improved design of a catalytic method and reactor for the production of methanol at equilibrium conditions whereby methanol as it is formed is separated from the gaseous phase into the liquid phase within the reactor without reducing the catalytic activity of the methanol catalyst. This is achieved by adjusting the boiling point or temperature of a liquid cooling agent being in indirect contact with the catalyst particles and by providing a specific ratio of catalyst bed volume to cooling surface area.  Thereby, condensation of methanol as it is formed in the gaseous phase takes place for the most at the cooling surface arranged evenly distributed within the reactor and if at all within a very limited region of the catalyst bed."
  },
  {
    "publication_number": "CA-1170440-A",
    "title": "Method and apparatus for making pile fabrics",
    "abstract": "METHOD AND APPARATUS FOR MAKING PILE FABRICS      ABSTRACT OF THE DISCLOSURE           A web is placed on a grooved cylinder, folded by pressing it into the cylinder grooves, and attached to a backing sheet to form a pile fabric.  Folding is performed by rollers with blades which enter and move along the length of the grooves.  The rollers are guided precisely by guide members on their opposite axial sides.  To prevent the rollers from pushing the textile material across the grooved cylinder surface, the rollers are rotated independently of their contact with the web."
  },
  {
    "publication_number": "CA-2472616-C",
    "title": "Non tank pressurizing fast fill receiver and system for vehicles",
    "abstract": "A refueling system for vehicles including a dual valve receiver (14) connected in fluid communication with the fuel tank (12), and a jet sensor (16) inside of the fuel tank and in fluid communication with the receiver. The refueling system further includes a relief valve vent (18) in fluid communication with the fuel tank to vent the fuel tank and to relieve pressure that may otherwise build up inside the fuel tank during refueling. When refueling with an automatic shutoff nozzle (20), the sensor detects when a desired fuel level has been reached, and then informs the receiver to prevent fuel flow into the tank. When this occurs, the pressure inside the receiver and automatic shutoff nozzle increases, causing the nozzle to shut off automatically."
  },
  {
    "publication_number": "US3910441A",
    "title": "Vacuum Insulated Bottle",
    "abstract": "A vacuum insulated bottle utilizing a wide opening vacuum filler is disclosed. A thin walled liner is disposed in the interior of the filler and extends upwardly therefrom to form a narrow mouth opening to the lined interior for providing the pouring and thermal insulating characteristics of a narrow mouth vacuum filler bottle."
  },
  {
    "publication_number": "US4427123A",
    "title": "Stainless steel thermos bottle",
    "abstract": "A stainless steel thermos bottle comprising inner and outer bottles made of stainless steel, the inner and outer bottles being joined together at tip portions of their bottlenecks to form a double-walled construction, the space created between the two bottles being a vacuum. The surfaces of the inner and outer bottles that surround the space are provided with at least one metal deposit at least on an outer surface of the inner bottle, except for a part or all of the bottleneck surfaces in the space. The part or all of the bottleneck surfaces in the space includes the surface of the joint between the two bottles."
  },
  {
    "publication_number": "US3456860A",
    "title": "Double wall cup",
    "abstract": "There is disclosed a cup having inner and outer walls drawn from sheets of plastic material and respectively formed with oppositely circumferentially and axially extending ridges which abut each other at spaced points for providing mutual support while minimizing heat transfer between the inner and outer walls"
  },
  {
    "publication_number": "US6405892B1",
    "title": "Thermally Insulated Beverage Glass",
    "abstract": "A thermally insulated beverage glass is provided as an insulated drinking glass made from glass with an interstitial space in the sides and bottom. The sides and bottom of the glass are double-walled, forming an interstitial space for insulating purposes. The interstitial space can be left filled with air, or filled with an insulating material such as Styrofoam®. The interstitial space not only reduces or eliminates condensation from forming on the exterior of the glass when filled with cold liquid on hot, humid days, but it also helps keep the liquid cooler. Alternately, when the glass is filled with hot liquid it also aids in keeping the liquid hotter, longer."
  },
  {
    "publication_number": "US9139352B2",
    "title": " Insulating container (Cooler Box)",
    "abstract": "An insulating device can include an aperture having a waterproof closure which allows access to the chamber within the insulating device. The closure can help prevent any fluid leakage into and out of the insulating device if the insulating device is overturned or in any configuration other than upright. The closure also prevents any fluid from permeating into the chamber if the insulating device is exposed to precipitation, other fluid, or submersed under water. This construction results in an insulating chamber impervious to water and other liquids when the closure is sealed."
  },
  {
    "publication_number": "US20080173704A1",
    "title": "US20080173704A1: Container for shipping and storing paper",
    "abstract": "A container for shipping and/or storing a stack of paper is disclosed. The container, according to a disclosed embodiment, comprises a bottom wall and first and second upright, opposing side walls extending from respective edges of the bottom wall. First and second shell portions are connected in a pivotal manner to respective edges of the bottom wall. The shell portions are pivotable toward and away from each to close and open the container, respectively. When the container is closed, the stack is securely contained between the shell portions and the side walls for shipping or storing. When the container is opened, at least two opposing sides of the stack are exposed to facilitate removal of paper from the container. A handle for carrying or lifting the container may be coupled to one of the shell portions."
  },
  {
    "publication_number": "US9061477B2",
    "title": "US9061477B2: Method and apparatus for making, shipping and erecting boxes",
    "abstract": "A cardboard box with four side panels, four bottom flaps and four top flaps. The box is made from a blank having a first height measured between the outermost edges of the top and bottom flaps. The flaps are rotated into abutting contact with the exterior surface of the panels thereby reducing the overall height of the box to the height of the panel. Adjacent pairs of top and bottom flaps are provided with living hinges that enable them to remain in this position when the box is collapsed. The collapsed box is shipped through the mail in this diminished size and then erected into a box of the same height as the panels."
  },
  {
    "publication_number": "US6464131B1",
    "title": "US6464131B1: Packing box design (Shipping Carton)",
    "abstract": "The present invention presents an innovative packing box for food-stuffs which may serve as both a shipping carton and as a display box. The carton is constructed from a single, continuous blank of corrugated cardboard or other suitable material. The carton includes inwardly sloping side walls with support ledges to allow for easy stacking of the cartons. The side walls are of folded over design which provides the walls with a double thickness of material for added durability. The carton further includes a front window which provides convenient access to the food-stuffs stored within."
  },
  {
    "publication_number": "US4279378A",
    "title": "US4279378A: Top gap folding box having a top closure interlock",
    "abstract": "A top gap folding box having four top flaps and a top closure by which the flaps are engaged. Each flap interlocks the adjacent flaps by means of a pair of incisions in the outer edge of the flap which each engage an associated incision in each of the adjacent flaps. The incisions are of a configuration permitting smooth engagement. The material of which the box is made is of a stiff nature, having resistance to bending."
  },
  {
    "publication_number": "US7669753B2",
    "title": "US7669753B2: Box flap locking system",
    "abstract": "The invention provides a foldable box design having a box flap locking system, comprising: a first flap having an edge with a generally trapezoidal shaped tab cut therein, wherein said generally trapezoidal shaped tab is defined by two inwardly projecting grooves; and a second flap that locks with the first flap, wherein the second flap includes an edge with a second generally trapezoidal shaped tab cut therein, and wherein said second generally trapezoidal shaped tab is defined by two outwardly projecting grooves."
  }
]